SecurityEvent
| where EventID == 4688
| where CommandLine has_any ("whoami","ipconfig","net user","hostname","systeminfo")
| summarize ReconCount=count() by bin(TimeGenerated, 15m)
| order by TimeGenerated asc